# CannotJoinDesignOptions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..CannotJoinDesignOptions Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotJoinDesignOptions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotJoinDesignOptions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotJoinDesignOptions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace